app/Controllers/API/Roles.php

DELETE FROM `rol`
WHERE `id` IN ('2')
---
        public function eliminar($id = null) {
            try {
                if ($id == null)
                    return $this->failValidationError('Id no válido.');
                $rol = $this->model->find($id);
                if ($rol == null)
                    return $this->failNotFound('No se ha encontrado un rol con el Id = '. $id);
                if ($this->model->delete($id))