app/Controllers/API/TipoTransaccion.php

INSERT INTO `tipo_transaccion` (`descripcion`, `created_at`, `updated_at`) VALUES ('Ahorro', '2023-01-07 11:56:59', '2023-01-07 11:56:59')
---
        public function crear() {
            try {
                $tipoTransaccion = $this->request->getJSON();
                if ($this->model->insert($tipoTransaccion))

UPDATE `tipo_transaccion` SET `descripcion` = 'Abono', `updated_at` = '2023-01-07 12:02:47'
WHERE `tipo_transaccion`.`id` IN ('9')
---
        public function actualizar($id = null) {
            try {
                if ($id == null)
                    return $this->failValidationError('Id no válido.');
                $tipoTransaccionVerificado = $this->model->find($id);
                if ($tipoTransaccionVerificado == null)
                    return $this->failNotFound('No se ha encontrado un tipo de transacción con el Id = '. $id);
                $tipoTransaccion = $this->request->getJSON();
                if ($this->model->update($id, $tipoTransaccion)) {

DELETE FROM `tipo_transaccion`
WHERE `id` IN ('7')
---
        public function eliminar($id = null) {
            try {
                if ($id == null)
                    return $this->failValidationError('Id no válido.');
                $tipoTransaccion = $this->model->find($id);
                if ($tipoTransaccion == null)
                    return $this->failNotFound('No se ha encontrado un tipo de transacción con el Id = '. $id);
                if ($this->model->delete($id))