app/Controllers/API/Transaccion.php

        public function crear() {
            try {
                $transaccion = $this->request->getJSON();
                if ($this->model->insert($transaccion)) {
                    $transaccion->id = $this->model->insertID();  // insertID() devuelve el id recien ingresado a la base de datos.
---
INSERT INTO `transaccion` (`cuenta_id`, `tipo_transaccion_id`, `monto`, `created_at`, `updated_at`) VALUES ('1', '1', '2000.00', '2022-12-07 19:43:30', '2022-12-07 19:43:30')
INSERT INTO `transaccion` (`cuenta_id`, `tipo_transaccion_id`, `monto`, `created_at`, `updated_at`) VALUES ('5211', '1', '2000.00', '2022-12-07 05:29:33', '2022-12-07 05:29:33')

        private function actualizarFondoCuenta($tipoTransaccionId, $monto, $cuentaId) {
            $modeloCuenta = new CuentaModel();
            $cuenta = $modeloCuenta->find($cuentaId);
            switch ($tipoTransaccionId) {
                case 1:
                    $cuenta['fondo'] += $monto;
                    break;
                case 2:
                    $cuenta['fondo'] -= $monto;
                    break;
            }
            if ($modeloCuenta->update($cuentaId, $cuenta))
---
SELECT *
FROM `cuenta`
WHERE `cuenta`.`id` = '1'
UPDATE `cuenta` SET `moneda` = 'USD', `fondo` = '2000.00', `cliente_id` = '1', `updated_at` = '2022-12-07 19:43:30'
WHERE `cuenta`.`id` IN ('1')

        public function cliente($id = null) {
            try {
                $modeloCliente = new ClienteModel();
                if ($id == null)
                    return $this->failValidationError('Id no válido.');
                $cliente = $modeloCliente->find($id);
---
SELECT *
FROM `cliente`
WHERE `cliente`.`id` = '2'