app/Controllers/API/Usuarios.php

        public function actualizar($id = null) {
            try {
                if ($id == null)
                    return $this->failValidationError('Id no válido.');
                $cuentaVerificada = $this->model->find($id);
                if ($cuentaVerificada == null)
                    return $this->failNotFound('No se ha encontrado un usuario con el Id = '. $id);
                $usuario = $this->request->getJSON();
                if ($this->model->update($id, $usuario)) {
---
UPDATE `usuario` SET `nombre` = 'Jersire', `usuario` = 'catalina', `updated_at` = '2023-01-07 17:51:53'
WHERE `usuario`.`id` IN ('2')

        public function eliminar($id = null) {
            try {
                if ($id == null)
                    return $this->failValidationError('Id no válido.');
                $usuario = $this->model->find($id);
                if ($usuario == null)
                    return $this->failNotFound('No se ha encontrado un usuario con el Id = '. $id);
                if ($this->model->delete($id))
---
DELETE FROM `usuario`
WHERE `id` IN ('2')