app/Models/ReglasPropias/ReglasPropias.php

SELECT *
FROM `cliente`
WHERE `cliente`.`id` = 1
---
		public function cliente_valido(int $id): bool {
			$modelo = new ClienteModel();
			$cliente = $modelo->find($id);

SELECT *
FROM `cuenta`
WHERE `cuenta`.`id` = 1
---
		public function cuenta_valida(int $id): bool {
			$modelo = new CuentaModel();
			$cuenta = $modelo->find($id);

SELECT *
FROM `tipo_transaccion`
WHERE `tipo_transaccion`.`id` = 1
---
		public function tipo_transaccion_valida(int $id): bool {
			$modelo = new TipoTransaccionModel();
			$tipo_transaccion = $modelo->find($id);