app/Controllers/Autenticacion.php

SELECT *
FROM `usuario`
WHERE `usuario` = 'legato'
 LIMIT 1
---
        public function login() {
            try {
                $usuario = $_POST['usuario'];
                $pass = $_POST['pass'];
                $usuarioModel = new UsuarioModel();
                $validarUsuario = $usuarioModel->where('usuario', $usuario)->first();